app/views/orders/index.html.erb

SELECT "orders".* FROM "orders"
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 15]]
---
                <ul class="list-group list-group-flush">
                  <% order.order_items.each do |order_item| %>