app/controllers/cart_items_controller.rb

  def create
    product = Product.find(params[:product_id])
    @cart_item = CartItem.create(user_id: current_user.id, product_id: product.id)
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "cart_items" ("user_id", "product_id", "created_at", "updated_at", "quantity") VALUES (?, ?, ?, ?, ?)  [["user_id", 2], ["product_id", 4], ["created_at", "2024-11-23 11:29:25.149794"], ["updated_at", "2024-11-23 11:29:25.149794"], ["quantity", nil]]

  def destroy
    @cart_item = CartItem.find(params[:id])
    if @cart_item.user_id == current_user.id
      @cart_item.destroy
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 1]]