app/controllers/feedbacks_controller.rb

  def new
    @feedback = Feedback.new
    @feedbacks = Feedback.all.order(created_at: :desc) if current_user.admin?
---
SELECT "feedbacks".* FROM "feedbacks" ORDER BY "feedbacks"."created_at" DESC

  def create
    @feedback = Feedback.new(feedback_params)
    if @feedback.save
---
INSERT INTO "feedbacks" ("name", "email", "message", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  def destroy
    @feedback = Feedback.find(params[:id])
    @feedback.destroy
---
SELECT "feedbacks".* FROM "feedbacks" WHERE "feedbacks"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "feedbacks" WHERE "feedbacks"."id" = ?  [["id", 2]]