app/controllers/home_controller.rb

SELECT "products".* FROM "products"
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."user_id" = ?  [["user_id", 1]]
SELECT SUM("products"."price") FROM "cart_items" INNER JOIN "products" ON "products"."id" = "cart_items"."product_id" WHERE "cart_items"."user_id" = ?  [["user_id", 1]]
---
  def index
    @products = Product.all # отримуємо всі продукти
    @cart_items = CartItem.where(user_id: current_user.id) # припускаємо, що є модель CartItem
    @total_price = @cart_items.joins(:product).sum('products.price')