app/controllers/orders_controller.rb

  def index
    if current_user.admin?
      @orders = Order.all
    else
      @orders = current_user.orders
---
SELECT "orders".* FROM "orders"
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = ?  [["user_id", 5]]

  def create
    @cart_items = CartItem.where(user_id: current_user.id)
    @total_price = @cart_items.sum { |item| item.product.price }

    @order = Order.new(
      user_id: current_user.id,
      address: params[:address],
      delivery_method: params[:delivery_method],
      payment_method: params[:payment_method],
      postal_code: params[:postal_code],
      credit_card_number: params[:credit_card_number],
      total: @total_price,
      status: 'pending'  # Статус за замовчуванням
    )


    if @order.save
      # Створити OrderItems для кожного товару в кошику
      @cart_items.each do |cart_item|
        OrderItem.create(
          order: @order,
          product: cart_item.product,
          quantity: 1
        )
      end

      # Очистити кошик
      @cart_items.destroy_all
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."user_id" = ?  [["user_id", 4]]
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "orders" ("created_at", "updated_at", "delivery_method", "payment_method", "postal_code", "credit_card_number", "user_id", "address", "total", "status") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
INSERT INTO "order_items" ("created_at", "updated_at", "order_id", "product_id", "quantity") VALUES (?, ?, ?, ?, ?)  [["created_at", "2024-11-24 13:44:39.853343"], ["updated_at", "2024-11-24 13:44:39.853343"], ["order_id", 17], ["product_id", 1], ["quantity", 1]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 32]]

  def destroy
    Rails.logger.debug "Params: #{params.inspect}"  # Перевірка параметрів
    @order = Order.find_by(id: params[:id])
    if @order
      if @order.destroy
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
DELETE FROM "orders" WHERE "orders"."id" = ?  [["id", 15]]

  def update_status
    @order = Order.find_by(id: params[:id])
    if current_user.admin?
      if @order.update(status: params[:status])
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
UPDATE "orders" SET "updated_at" = ?, "status" = ? WHERE "orders"."id" = ?  [["updated_at", "2024-11-24 13:44:50.721999"], ["status", "delivered"], ["id", 17]]