app/controllers/products_controller.rb

INSERT INTO "products" ("name", "description", "price", "created_at", "updated_at", "image_url", "category", "manufacturer", "release_date", "warranty_period") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @product = Product.new(product_params)
    if @product.save

SELECT "reviews".* FROM "reviews" WHERE "reviews"."product_id" = ? AND "reviews"."user_id" = ? LIMIT ?  [["product_id", 2], ["user_id", 1], ["LIMIT", 1]]
---
  def current_user_review
    @current_user_review ||= @product.reviews.find_by(user: current_user)