app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("rating", "content", "user_id", "product_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["rating", 5], ["content", "Крута кавова машина"], ["user_id", 1], ["product_id", 2], ["created_at", "2024-11-23 10:30:55.662707"], ["updated_at", "2024-11-23 10:30:55.662707"]]
---
  def create
    @review = @product.reviews.build(review_params.merge(user: current_user))

    if @review.save

UPDATE "reviews" SET "rating" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["rating", 3], ["updated_at", "2024-11-23 10:58:56.091293"], ["id", 1]]
---
  def update
    if @review.update(review_params)

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def set_product
    @product = Product.find(params[:product_id])