app/views/products/show.html.erb

              <h3 class="reviews-title mb-4">Відгуки</h3>
              <% if @product.reviews.any? %>
                <ul class="list-unstyled">
                  <% @product.reviews.each do |review| %>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."product_id" = ?  [["product_id", 2]]
SELECT 1 AS one FROM "reviews" WHERE "reviews"."product_id" = ? LIMIT ?  [["product_id", 17], ["LIMIT", 1]]